---
layout: post
title:  "na.action是什么？"
date:   2015-08-16 15:19:02
author: 吴珂皓
categories: r
keywords: SKAT, SNP, R语言, 罕见变异, Rare variant
excerpt: 解读SKAT源代码
---
#### na.action有哪些选项？
在一些R语言函数里面，na.action通常用来描述如何处理na值。R语言里面na.action通常有以下几个选项：

1. na.omit和na.exclude。 如果数据中有na值，那么这个选项会返回一个删除na值的结果。

2. na.pass。这个选项不会对数据做任何改变。

3. na.fail。如果这个数据中有na值，那么设置该选项的情况下会报错。只有不包括缺失数据的时候才会正常返回该数据。

下面我们做一个实验，我们假设存在dat1和dat2，其中dat1的第三行和第四行是包含缺失值的。第一步我们先生成两组数据：

    > dat1 = data.frame(x=1:10,y=rnorm(10))
    > dat2 = data.frame(x=1:10,y=rnorm(10))
    > dat1[3:4,1] = NA
    > dat1
        x           y
    1   1 -1.51882619
    2   2 -0.31069275
    3  NA -0.06685152
    4  NA -0.28851200
    5   5  1.73877855
    6   6 -0.88811053
    7   7  0.43101797
    8   8 -0.39802173
    9   9 -0.03002873
    10 10 -0.50883660
    > dat2
        x          y
    1   1  1.6928076
    2   2 -0.5833406
    3   3 -1.3238759
    4   4  0.5997470
    5   5  0.4790925
    6   6  1.0422295
    7   7  1.9524881
    8   8 -1.1134273
    9   9 -0.6500941
    10 10 -0.4382900

接下来我们先比较一下na.omit这个选项：

    > model.frame(y~x,na.action = na.omit,dat1)
                 y  x
    1  -1.51882619  1
    2  -0.31069275  2
    5   1.73877855  5
    6  -0.88811053  6
    7   0.43101797  7
    8  -0.39802173  8
    9  -0.03002873  9
    10 -0.50883660 10
    > model.frame(y~x,na.action = na.omit,dat2)
                y  x
    1   1.6928076  1
    2  -0.5833406  2
    3  -1.3238759  3
    4   0.5997470  4
    5   0.4790925  5
    6   1.0422295  6
    7   1.9524881  7
    8  -1.1134273  8
    9  -0.6500941  9
    10 -0.4382900 10

我们可以看到dat1没有返回第三、第四行给我们。接下来我们再试试na.exclude选项。

    > model.frame(y~x,na.action = na.exclude,dat1)
                 y  x
    1  -1.51882619  1
    2  -0.31069275  2
    5   1.73877855  5
    6  -0.88811053  6
    7   0.43101797  7
    8  -0.39802173  8
    9  -0.03002873  9
    10 -0.50883660 10
    > model.frame(y~x,na.action = na.exclude,dat2)
                y  x
    1   1.6928076  1
    2  -0.5833406  2
    3  -1.3238759  3
    4   0.5997470  4
    5   0.4790925  5
    6   1.0422295  6
    7   1.9524881  7
    8  -1.1134273  8
    9  -0.6500941  9
    10 -0.4382900 10

na.exclude的结果跟na.omit的结果是一样的。我们再看看na.pass的结果。

    > model.frame(y~x,na.action = na.pass,dat1)
                 y  x
    1  -1.51882619  1
    2  -0.31069275  2
    3  -0.06685152 NA
    4  -0.28851200 NA
    5   1.73877855  5
    6  -0.88811053  6
    7   0.43101797  7
    8  -0.39802173  8
    9  -0.03002873  9
    10 -0.50883660 10
    > model.frame(y~x,na.action = na.pass,dat2)
                y  x
    1   1.6928076  1
    2  -0.5833406  2
    3  -1.3238759  3
    4   0.5997470  4
    5   0.4790925  5
    6   1.0422295  6
    7   1.9524881  7
    8  -1.1134273  8
    9  -0.6500941  9
    10 -0.4382900 10

na.pass没有删除任何数据，na值照样返回给我们了。我们再看看na.fail。

    > model.frame(y~x,na.action = na.fail,dat1)
    Error in na.fail.default(list(y = c(-1.51882619118265, -0.3106927544106,  : 
      missing values in object

    > model.frame(y~x,na.action = na.fail,dat2)
                y  x
    1   1.6928076  1
    2  -0.5833406  2
    3  -1.3238759  3
    4   0.5997470  4
    5   0.4790925  5
    6   1.0422295  6
    7   1.9524881  7
    8  -1.1134273  8
    9  -0.6500941  9
    10 -0.4382900 10

na.fail对于dat1的结果直接报错，没法正常运行下去，而对于dat2没有NA的数据则是正常运行。

#### 其他NA处理方法

缺失值在数据处理中非常重要，在R里面有is.na来判断是否是NA值，还有na.rm等选项来区分是否删除缺失值。complete.cases也是用来删除data.frame的缺失值。我谨在此抛砖引玉，还需各位同行多多注意和学习。